modified design
